src/InformationRegisters/ПРО_НастройкиУзловРегистрации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ПРО_НастройкиУзловРегистрации</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ИспользоватьПереопределениеРегистрации</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>УзелИнформационнойБазы</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ПРО_УзелПланаОбмена</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/InformationRegisters/ПРО_ПереопределяемыеПравилаРегистрацииОбъектов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ПРО_ПереопределяемыеПравилаРегистрацииОбъектов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>РегистрацияОбъектаРазрешена</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЭтоПОД</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПрименитьСобственноеПравило</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИсполняемыйКод</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>УзелИнформационнойБазы</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ПРО_УзелПланаОбмена</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбъектРегистрации</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ПРО_ИдентификаторОбъектаМетаданных</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/CommonModules/ПРО_УправлениеПравиламиРегистрацииСлужебный/Ext/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// MIT License  Copyright (c) 2025 Mikhail Nastaskov
////////////////////////////////////////////////////////////////////////////////

#Область СлужебныйПрограммныйИнтерфейс

// См. ОбщегоНазначенияПереопределяемый.ПриДобавленииОбработчиковУстановкиПараметровСеанса
Процедура ПриДобавленииОбработчиковУстановкиПараметровСеанса(Обработчики) Экспорт
	
	Обработчики.Вставить("ПРО_КэшПравилРегистрации", 
		"ПРО_УправлениеПравиламиРегистрацииСлужебный.УстановкаПараметровСеанса");
	
	Обработчики.Вставить("ПРО_ДатаКэшаПравилРегистрации", 
		"ПРО_УправлениеПравиламиРегистрацииСлужебный.УстановкаПараметровСеанса");
	
КонецПроцедуры

// Параметры:
//  ИмяПараметра - Строка
//  УстановленныеПараметры - Массив из Строка
//
Процедура УстановкаПараметровСеанса(ИмяПараметра, УстановленныеПараметры) Экспорт
	
	// Процедура обновления повторно-используемых значений и параметров сеанса.
	ЗагрузитьКэшПравилВПараметрСеанса();
	
	// Зарегистрируем имена параметров, которые установлены ранее
	УстановленныеПараметры.Добавить("ПРО_КэшПравилРегистрации");
	УстановленныеПараметры.Добавить("ПРО_ДатаКэшаПравилРегистрации");
	
КонецПроцедуры

// Проверяет актуальность кэша правил регистрации в параметрах сеанса и обновляет его при необходимости.
Процедура ПроверитьКэшМеханизмаРегистрации() Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	АктуальнаяМетка = ПолучитьФункциональнуюОпцию("ПРО_АктуальнаяДатаОбновленияПравилКэш");
	МеткаСеанса     = ПараметрыСеанса.ПРО_ДатаКэшаПравилРегистрации;
	
	Если МеткаСеанса <> АктуальнаяМетка Тогда
		ЗагрузитьКэшПравилВПараметрСеанса();
	КонецЕсли;
	
КонецПроцедуры

// Сбрасывает кэш правил регистрации: обновляет константу-метку и аннулирует
// повторно используемые значения в текущем сеансе.
// Вызывается из обработчиков подписок при записи в регистры правил.
//
Процедура СброситьКэшПравилРегистрации() Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	Константы.ПРО_ДатаСбросаКэшаПравилРегистрации.Установить(ТекущаяУниверсальнаяДата());
	
КонецПроцедуры

// Имя события журнала регистрации
// 
// Возвращаемое значение:
//  Строка - имя события
//
Функция ИмяСобытияЖурналаРегистрации() Экспорт
	
	Возврат НСтр("ru = 'ПРО Регистрация данных'",
			ОбщегоНазначения.КодОсновногоЯзыка());
	
КонецФункции

// Возвращает кэш правил регистрации из параметра сеанса.
//
// Возвращаемое значение:
//   ХранилищеЗначения - сериализованная структура кэша (УзлыПланаОбмена + ПравилаРегистрации)
Функция ЧтениеКэшаПравилСеанса() Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	Возврат ПараметрыСеанса.ПРО_КэшПравилРегистрации;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ЗагрузитьКэшПравилВПараметрСеанса()
	
	УстановитьПривилегированныйРежим(Истина);
	
	ОбновитьПовторноИспользуемыеЗначения();
	
	ЧастиЗапроса = Новый Массив;
	ЧастиЗапроса.Добавить(ТекстЗапросаУзловПлановОбмена());
	ЧастиЗапроса.Добавить(ОбщегоНазначения.РазделительПакетаЗапросов());
	ЧастиЗапроса.Добавить(ТекстЗапросаПравилРегистрации());
	
	ТекстЗапроса = СтрСоединить(ЧастиЗапроса, Символы.ПС);
	Запрос = Новый Запрос(ТекстЗапроса);
	РезультатыПакета = Запрос.ВыполнитьПакет();
	
	ТаблицаУзлов  = РезультатыПакета[0].Выгрузить();
	ТаблицаПравил = РезультатыПакета[1].Выгрузить();
	
	ТаблицаУзлов.Индексы.Добавить("ИмяПланаОбмена");
	ТаблицаПравил.Индексы.Добавить("УзелПланаОбмена,ПолноеИмяОбъекта");
	
	КэшСтруктура = Новый Структура;
	КэшСтруктура.Вставить("УзлыПланаОбмена",    ТаблицаУзлов);
	КэшСтруктура.Вставить("ПравилаРегистрации", ТаблицаПравил);
	
	ПараметрыСеанса.ПРО_КэшПравилРегистрации      = Новый ХранилищеЗначения(КэшСтруктура);
	ПараметрыСеанса.ПРО_ДатаКэшаПравилРегистрации = Константы.ПРО_ДатаСбросаКэшаПравилРегистрации.Получить();
	
КонецПроцедуры

#Область ТекстыЗапросов

Функция ТекстЗапросаУзловПлановОбмена()
	
	ТипыУзловПланаОбмена = Метаданные.ОпределяемыеТипы.ПРО_УзелПланаОбмена.Тип.Типы();
	
	ЧастиЗапроса = Новый Массив;
	Для Каждого ТипУзла Из ТипыУзловПланаОбмена Цикл
		
		МетаданныеОбъекта = Метаданные.НайтиПоТипу(ТипУзла);
		ИмяПланаОбмена = МетаданныеОбъекта.Имя;
		
		ТекстЧасти =
		"ВЫБРАТЬ
		|	&ИмяПланаОбмена КАК ИмяПланаОбмена,
		|	УзлыПлана.Ссылка КАК УзелПланаОбмена,
		|	ЕСТЬNULL(НастройкиУзлов.ИспользоватьПереопределениеРегистрации, ЛОЖЬ) КАК ИспользоватьПереопределение
		|ИЗ
		|	&ТаблицаИмениПланаОбмена КАК УзлыПлана
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПРО_НастройкиУзловРегистрации КАК НастройкиУзлов
		|		ПО УзлыПлана.Ссылка = НастройкиУзлов.УзелИнформационнойБазы
		|ГДЕ
		|	НЕ УзлыПлана.ЭтотУзел
		|	И НЕ УзлыПлана.ПометкаУдаления";
		ТекстЧасти = СтрЗаменить(ТекстЧасти, "&ИмяПланаОбмена",          """" + ИмяПланаОбмена + """");
		ТекстЧасти = СтрЗаменить(ТекстЧасти, "&ТаблицаИмениПланаОбмена", "ПланОбмена." + ИмяПланаОбмена);
		
		ЧастиЗапроса.Добавить(ТекстЧасти);
		
	КонецЦикла;
	
	Возврат СтрСоединить(ЧастиЗапроса, ОбщегоНазначения.ТекстОбъединитьВсе());
	
КонецФункции

Функция ТекстЗапросаПравилРегистрации()
	
	Возврат
	"ВЫБРАТЬ
	|	Правила.УзелИнформационнойБазы КАК УзелПланаОбмена,
	|	ЕСТЬNULL(ИдМета.ПолноеИмя, ИдРасш.ПолноеИмя) КАК ПолноеИмяОбъекта,
	|	Правила.РегистрацияОбъектаРазрешена КАК РегистрацияОбъектаРазрешена,
	|	Правила.ПрименитьСобственноеПравило КАК ПрименитьСобственноеПравило,
	|	Правила.ИсполняемыйКод КАК ИсполняемыйКод
	|ИЗ
	|	РегистрСведений.ПРО_ПереопределяемыеПравилаРегистрацииОбъектов КАК Правила
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ИдентификаторыОбъектовМетаданных КАК ИдМета
	|		ПО ВЫРАЗИТЬ(Правила.ОбъектРегистрации КАК Справочник.ИдентификаторыОбъектовМетаданных) = ИдМета.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ИдентификаторыОбъектовРасширений КАК ИдРасш
	|		ПО ВЫРАЗИТЬ(Правила.ОбъектРегистрации КАК Справочник.ИдентификаторыОбъектовРасширений) = ИдРасш.Ссылка";

КонецФункции

#КонецОбласти

#КонецОбласти
